-- AssetsConfig (ModuleScript) - v1.3 (Чистка)

local AssetsConfig = {

	-- ИЗМЕНЕНИЕ: Убрали дубликат отсюда для чистоты кода.
	-- Теперь FaceAccessory находится только в одном месте - в разделе BodyParts.

	-- ID картинок для UI
	ImageIds = {
		Arrow = "rbxassetid://93412782386309",
	},

	-- Иконки для UI
	GenderIcons = {
		Male = "rbxassetid://7344148200387",
		Female = "rbxassetid://97583083620536"
	},

	-- Одежда
	Clothing = {
		Male = {
			ShirtTemplate = "rbxassetid://6956985903",
			PantsTemplate = "rbxassetid://7287986280"
		},
		Female = {
			ShirtTemplate = "rbxassetid://7285836138",
			PantsTemplate = "rbxassetid://7285838872"
		}
	},

	-- Волосы
	Hair = {
		Male = {
			100133123162861, 108357462076863, 15555787126, 14649898546,
			95122213623894, 136344972759603, 84239600712080, 134546582497082,
			14497559720, 18713438954, 77721203334125, 12813173657, 14475747407,
			8030727561, 103167977932946, 14558472275, 5163640422
		},
		Female = {
			13458469597, 14648796380, 12865215646, 13937433171,
			15309174539, 18395405751, 17403216610, 83999392924327,
			11270150139, 10561460359, 17616595398, 18416520411,
			137357612887179, 115783122893951, 85201976807991,
			114178105053908, 122583851796704
		}
	},

	-- Части тела
	BodyParts = {
		MaleTorso = 0,
		FemaleTorso = 48474356,
		-- Теперь это единственное место, где хранится ID аксессуара для лица.
		FaceAccessory = 71342592540266 
	},
	
	--Анимации Манекенов
	MannequinAnimations = {
		Slot1 = "rbxassetid://107507445198731", -- анимация для первого манекена
		Slot2 = "rbxassetid://110823766645836", -- анимация для второго манекена  
		Slot3 = "rbxassetid://104674712073821", -- анимация для третьего манекена
	},

}

return AssetsConfig